app/controllers/events_controller.rb

INSERT INTO "events" ("title", "date", "time", "created_at", "updated_at", "num_vols") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["date", Fri, 10 Mar 2017], ["time", 2017-03-10 22:17:00 UTC], ["created_at", 2017-03-10 22:18:30 UTC], ["updated_at", 2017-03-10 22:18:30 UTC], ["num_vols", "4"]]
---
  def create
    if !organization_signed_in?
      return
    end

    # Process the start time and end time
    st = process_start_time
    et = process_end_time

    # Gather all the parameters and save them into a new event
    event_info = { :start_time => st, :end_time => et, :name => event_params[:name],
      :description => event_params[:description], :num_vols => event_params[:num_vols], :location => event_params[:location],
      :contact_phone => event_params[:contact_phone], :contact_email => event_params[:contact_email]}

    @event = current_organization.events.new(event_info)

    if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "events" SET "time" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["time", 2000-01-01 14:12:00 UTC], ["updated_at", 2017-03-10 20:17:27 UTC], ["id", 13]]
---
  def update
    if !organization_signed_in?
      return
    end

    # Process the start time and end time
    st = process_start_time
    et = process_end_time

    # Gather all the parameters and save them into a new event
    event_info = { :start_time => st, :end_time => et, :name => event_params[:name],
      :description => event_params[:description], :num_vols => event_params[:num_vols], :location => event_params[:location],
      :contact_phone => event_params[:contact_phone], :contact_email => event_params[:contact_email]}

    @event = Event.find(params[:id])

    if (@event.update(event_info))