app/controllers/organizations_controller.rb

SELECT "organizations".* FROM "organizations"
---
  def index
    @organizations = Organization.all

INSERT INTO "organizations" ("name", "address", "city", "state", "zip", "phone", "email", "mission", "website", "password", "confirm", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @organization = Organization.new(organization_params)

    respond_to do |format|
      if @organization.save

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_organization
      @organization = Organization.find(params[:id])